# While15. Начальный вклад в банке равен 1000 руб. Через каждый месяц размер
# вклада увеличивается на P процентов от имеющейся суммы
# (P — вещественное число, 0 < P < 25). По данному P определить, через сколько
# месяцев размер вклада превысит 1100 руб., и вывести найденное количество
# месяцев K (целое число) и итоговый размер вклада S (вещественное число).
p = float(input())
deposit = 1000.0
months = 0
while deposit <= 1100:
    deposit = deposit * (1 + p / 100)
    months += 1
print(months)
print(deposit)
